app/views/houses/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."house_id" = ?  [["house_id", 1]]
---
    <ul>
      <% house.projects.each do |project| %>