app/views/houses/show.html.erb

SELECT  1 AS one FROM "projects" WHERE "projects"."house_id" = ? LIMIT ?  [["house_id", 2], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."house_id" = ?  [["house_id", 1]]
---
<h2>Now Viewing: <%= @house.address %></h2>
<% if @house.projects.empty? %>