app/views/projects/_project.html.erb

SELECT  "materials".* FROM "materials" ORDER BY "materials"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
      Quantity Needed: <%= items_builder.number_field :quantity %>
                       <%= items_builder.hidden_field :material_id, value: Material.all.last.id + 1 %>