app/views/projects/new.html.erb

    Quantity Needed: <%= items_builder.number_field :quantity %>
                     <%= items_builder.hidden_field :material_id, value: Material.all.last.id + 1 %>
---
SELECT  "materials".* FROM "materials" LIMIT ?  [["LIMIT", 11]]