app/views/projects/show.html.erb

<ul>
  <% @project.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."project_id" = ?  [["project_id", 1]]