app/controllers/materials_controller.rb

SELECT  "materials".* FROM "materials" ORDER BY "materials"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @material = Material.new()
    @materials = Material.all

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @material = Material.find(params[:id])

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @material = Material.find(params[:id])

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def update
    @material = Material.find(params[:id])

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "materials" WHERE "materials"."id" = ?  [["id", 7]]
---
  def destroy
    @material = Material.find(params[:id])
    @material.delete