app/controllers/projects_controller.rb

  def index
    if params[:house_id]
      @house = House.find(params[:house_id])
      @projects = @house.projects
    else
      @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def show
    @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @project = Project.new()
    if params[:house_id]
      @project.house = House.find(params[:house_id])
    else
      #TODO Currently there is no access through clickable means therefore redirect
      #@project.house = House.find(params[:id].to_i) would need to modify new.html.erb to include assiging a house
      redirect_to houses_path
    end

    @materials = Material.all
---
SELECT  "houses".* FROM "houses" WHERE "houses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "materials".* FROM "materials" ORDER BY "materials"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @project = Project.new()
    @project.update(project_params)
    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "house_id") VALUES (?, ?, ?, ?)  [["name", "test"], ["created_at", "2018-02-14 16:04:14.086501"], ["updated_at", "2018-02-14 16:04:14.086501"], ["house_id", 2]]

  def update
    @project = Project.find(params[:id])
    @project.update(project_params)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "status" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["status", "complete"], ["updated_at", "2018-02-14 16:00:13.084494"], ["id", 2]]

  def destroy
    @project = Project.find(params[:id])
    @house = @project.house
    @project.delete
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 3]]