app/controllers/projects_controller.rb

SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def new
    @project = Project.new()
    @project.house = House.find(params[:id].to_i)
    @materials = Material.all
    Material.all.size.times {@project.items.build}