app/views/materials/_form.html.erb

SELECT  "materials".* FROM "materials" ORDER BY "materials"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
<%= form_for @material, :html => { :id => 'material-' + "#{Material.last.id + 1}" } do |f| %>