app/views/materials/index.html.erb

<ul>
  <% Material.all.each do |material| %>
---
SELECT  "materials".* FROM "materials" ORDER BY "materials"."id" DESC LIMIT ?  [["LIMIT", 1]]