app/views/materials/show.html.erb

SELECT "projects".* FROM "projects"
SELECT  1 AS one FROM "materials" INNER JOIN "items" ON "materials"."id" = "items"."material_id" WHERE "items"."project_id" = ? AND "materials"."id" = ? LIMIT ?  [["project_id", 1], ["id", 1], ["LIMIT", 1]]
---
<ul>
  <% Project.all.each do |project| %>
  <% if project.materials.exists?(@material.id) %>